<?php /* Template Name: Каталог платьев */ ?>

<?php get_header(); ?>
    <style>
        @import url(<?= get_stylesheet_directory_uri() . '/css/about.css'?>);
        @import url(<?= get_stylesheet_directory_uri() . '/css/dresses-page.css'?>);
    </style>

<?php
global $post;
$terms = get_terms(array(
    'dress_type'    
),
    array(
        'orderby' => 'name',
        'order' => 'ASC',
    )
);
// var_dump($terms);
?>

<section class="section-dresses">

    <div class="dresses-block">
        <?php foreach ($terms as $key => $term): ?>
            <a href="/dress_type/<?= $term->slug?>/">
                <?php echo $term->name; ?>
            </a>
            <?= $action = ((count($terms)-1) == $key) ? '' : '<hr>';?>
        <?php endforeach ?>
    </div>

    <div class="dresses-social">
        <ul>
            <li>
                <a href="<?php echo home_url(); ?>">
                    <svg width="18" height="18" viewBox="0 0 18 18" fill="#fff" xmlns="http://www.w3.org/2000/svg">
                        <path d="M13.4994 0.0037452L11.1653 0C8.5429 0 6.84821 1.73871 6.84821 4.42982V6.47227H4.5013C4.2985 6.47227 4.13428 6.63668 4.13428 6.83949V9.79876C4.13428 10.0016 4.29869 10.1658 4.5013 10.1658H6.84821V17.633C6.84821 17.8358 7.01243 18 7.21524 18H10.2773C10.4801 18 10.6443 17.8356 10.6443 17.633V10.1658H13.3884C13.5912 10.1658 13.7554 10.0016 13.7554 9.79876L13.7565 6.83949C13.7565 6.74211 13.7178 6.64886 13.6491 6.57994C13.5803 6.51103 13.4867 6.47227 13.3893 6.47227H10.6443V4.74086C10.6443 3.90868 10.8426 3.48622 11.9267 3.48622L13.4991 3.48566C13.7017 3.48566 13.8659 3.32124 13.8659 3.11863V0.370775C13.8659 0.168347 13.7019 0.00411972 13.4994 0.0037452Z"/>
                    </svg>
                </a>
            </li>
            <li>
                <a href="<?php echo home_url(); ?>">
                    <svg width="18" height="18" viewBox="0 0 18 18" fill="white" xmlns="http://www.w3.org/2000/svg">
                        <path d="M12.375 0H5.625C2.51888 0 0 2.51888 0 5.625V12.375C0 15.4811 2.51888 18 5.625 18H12.375C15.4811 18 18 15.4811 18 12.375V5.625C18 2.51888 15.4811 0 12.375 0ZM16.3125 12.375C16.3125 14.5463 14.5463 16.3125 12.375 16.3125H5.625C3.45375 16.3125 1.6875 14.5463 1.6875 12.375V5.625C1.6875 3.45375 3.45375 1.6875 5.625 1.6875H12.375C14.5463 1.6875 16.3125 3.45375 16.3125 5.625V12.375Z"/>
                        <path d="M9 4.5C6.51487 4.5 4.5 6.51487 4.5 9C4.5 11.4851 6.51487 13.5 9 13.5C11.4851 13.5 13.5 11.4851 13.5 9C13.5 6.51487 11.4851 4.5 9 4.5ZM9 11.8125C7.44975 11.8125 6.1875 10.5503 6.1875 9C6.1875 7.44863 7.44975 6.1875 9 6.1875C10.5503 6.1875 11.8125 7.44863 11.8125 9C11.8125 10.5503 10.5503 11.8125 9 11.8125Z"/>
                        <path d="M13.8374 4.76211C14.1686 4.76211 14.437 4.49365 14.437 4.16249C14.437 3.83133 14.1686 3.56287 13.8374 3.56287C13.5063 3.56287 13.2378 3.83133 13.2378 4.16249C13.2378 4.49365 13.5063 4.76211 13.8374 4.76211Z"/>
                    </svg>
                </a>
            </li>
            <li>
                <a href="<?php echo home_url(); ?>">
                    <svg width="20" height="20" viewBox="0 0 20 20" fill="white" xmlns="http://www.w3.org/2000/svg">
                        <path d="M10.2716 0C4.79013 0 1.875 3.51266 1.875 7.34283C1.875 9.11916 2.86754 11.3343 4.45637 12.0368C4.69763 12.1455 4.82888 12.0993 4.88264 11.8755C4.93014 11.7055 5.1389 10.8867 5.24015 10.5005C5.2714 10.3767 5.25515 10.2692 5.15515 10.153C4.62762 9.54293 4.20885 8.43163 4.20885 7.38908C4.20885 4.71771 6.3327 2.12385 9.94661 2.12385C13.0718 2.12385 15.2581 4.15394 15.2581 7.05782C15.2581 10.3392 13.5218 12.6093 11.2654 12.6093C10.0166 12.6093 9.08657 11.6293 9.38159 10.4167C9.73785 8.9729 10.4366 7.42033 10.4366 6.37904C10.4366 5.44525 9.90911 4.67271 8.83156 4.67271C7.56026 4.67271 6.52896 5.93152 6.52896 7.62159C6.52896 8.69539 6.90898 9.42042 6.90898 9.42042C6.90898 9.42042 5.65142 14.5007 5.41766 15.4494C5.02264 17.0558 5.47141 19.6571 5.51016 19.8809C5.53391 20.0047 5.67267 20.0434 5.75017 19.9421C5.87393 19.7796 7.394 17.6108 7.82027 16.0432C7.97527 15.4719 8.61155 13.1556 8.61155 13.1556C9.03032 13.9119 10.2391 14.5457 11.5267 14.5457C15.3569 14.5457 18.1245 11.1793 18.1245 7.00156C18.1107 2.99638 14.6831 0 10.2716 0Z"/>
                    </svg>
                </a>
            </li>
            <li>
                <a href="<?php echo home_url(); ?>">
                    <svg width="22" height="22" viewBox="0 0 22 22" fill="white" xmlns="http://www.w3.org/2000/svg">
                        <path d="M21.5467 5.71886C21.2931 4.77641 20.5501 4.03352 19.6078 3.77974C17.8862 3.30859 10.9998 3.30859 10.9998 3.30859C10.9998 3.30859 4.11357 3.30859 2.39197 3.76178C1.46781 4.01539 0.706632 4.77657 0.453016 5.71886C0 7.44029 0 11.0104 0 11.0104C0 11.0104 0 14.5984 0.453016 16.3019C0.706799 17.2442 1.44969 17.9872 2.39214 18.241C4.1317 18.7122 11 18.7122 11 18.7122C11 18.7122 17.8862 18.7122 19.6078 18.259C20.5502 18.0054 21.2931 17.2623 21.5469 16.32C21.9999 14.5984 21.9999 11.0285 21.9999 11.0285C21.9999 11.0285 22.018 7.44029 21.5467 5.71886Z"/>
                        <path d="M8.80713 14.3087L14.5336 11.0105L8.80713 7.71228V14.3087Z" fill="#C48E8E"/>
                    </svg>
                </a>
            </li>
            <li>
                <a href="<?php echo home_url(); ?>">
                    <svg width="18" height="18" viewBox="0 0 18 18" fill="white" xmlns="http://www.w3.org/2000/svg">
                        <path d="M4.02525 5.625H0V18H4.02525V5.625Z"/>
                        <path d="M14.9895 5.77013C14.9468 5.75663 14.9062 5.742 14.8612 5.72962C14.8073 5.71725 14.7532 5.70713 14.6981 5.69813C14.4844 5.65538 14.2504 5.625 13.9759 5.625C11.6291 5.625 10.1407 7.33163 9.65025 7.99088V5.625H5.625V18H9.65025V11.25C9.65025 11.25 12.6923 7.01325 13.9759 10.125C13.9759 12.9026 13.9759 18 13.9759 18H18V9.64912C18 7.77937 16.7186 6.22125 14.9895 5.77013Z"/>
                        <path d="M1.96875 3.9375C3.05606 3.9375 3.9375 3.05606 3.9375 1.96875C3.9375 0.881439 3.05606 0 1.96875 0C0.881439 0 0 0.881439 0 1.96875C0 3.05606 0.881439 3.9375 1.96875 3.9375Z"/>
                    </svg>
                </a>
            </li>
        </ul>
    </div>

</section>






<!-- <section class="section-catalog-list">
    <div class="container">
        <button class="btn-filter">
            Фильтры <i class="icon-options"></i>
        </button>
        <div class="filter-col">
            <div class="filters">
                <?php //echo do_shortcode( '[mdf_search_form id="198"]' ); ?>
                <?php dynamic_sidebar('filter_taxonomy'); ?>
            </div>
        </div>
        <div class="catalog-col">
            <div class="products-list">
                <?php
                $query = new WP_Query(array(//'posts_per_page'=>9,
                    'post_type' => 'dresses',
                    //'paged' => get_query_var('paged') ? get_query_var('paged') : 1)
                ));

                ?>
                <?php //while (have_posts()) : the_post();?>
                <?php if ($query->have_posts()) : while ($query->have_posts()) : $query->the_post(); ?>
                    <?php $mainImg = get_field('featured_img'); ?>
                    <div id="<?php echo $post->ID ?>" class="product-col">
                        <div class="product-item">
                            <div class="product-img">
                                <button class="btn-add-basket"><i class="icon-add"></i></button>
                                <a href="<?php echo the_permalink(); ?>" title="<?php the_title(); ?>"><img
                                            src="<?php echo $mainImg; ?>" alt=""></a>
                            </div>
                            <a href="<?php echo the_permalink(); ?>" title="ricca sposa <?php the_title(); ?>"
                               class="product-name">
                                <div class="name"><?php the_title(); ?></div>
                                <img class="arrow"
                                     src="<?php echo get_stylesheet_directory_uri(); ?>/img/arrow-dark.svg" alt="">
                            </a>
                        </div>
                    </div>

                <?php endwhile; endif ?>

            </div>

            <div class="pagination-wrapp">

            </div>
            <?php wp_reset_postdata(); ?>
        </div>
    </div>
</section> -->